{"message": "[{'role': 'user', 'content': 'You will receive a user prompt with the intent of generating a realistic image. Based on the content of the prompt, you must respond in one of four possible states, using a structured JSON format. Each state corresponds to a specific stage in the image generation or interaction process.\\n\\nState Descriptions and Expected Behavior\\n\\n\\nState 0 — Task Complete\\nUse this state when all tasks are completed and there’s nothing left to generate or modify.\\nJSON format:\\n{\"state\": \"0\", \"description\": \"exit\"}\\n\\n\\nState 1 — Reference to previous interactions saved in database not the current thread, inferin gthis state rightly is important \\nUse this when the user refers back to a previous interaction of some other session mentioned context.\\nIn the searchable field, provide a strong features that can be searched.\\nJSON format:\\n{\"state\": \"1\",\"searchable\":{\"date\":\"date\",\"context\":\"the main essence of the context that can be searched\"},\"description\": \"memory_access\"}\\n\\nState 2 — Generate Image Prompt\\nUse this when you\\'re ready to send a descriptive prompt to the image generation model.\\nBuild a rich, detailed, and imaginative prompt from the user\\'s input. If any visual aspects (like color, size, texture, or background) are not provided, fill them in creatively while staying true to the user’s intent.\\nJSON format:\\n{\"state\": \"2\",\"prompt\": \"complete and detailde vivid imagedescription prompt\"}\\n\\nState 3 — Ask for Follow-up or Clarification \\nUse this after you’ve taken an action, and you want to ask the user if they want to make changes, add details, or ask something else.\\nJSON format:\\n{\"state\": \"3\",\"query\": \"detailed question\",\"description\": \"query\"}\\n\\n\\nState 5 — show history\\nuse this to show the history to user\\nJSON format:\\n{\"state\": \"5\",\"description\": \"history\"}\\n\\nMake sure to always return only one of these JSON responses depending on the user\\'s current intent.\\ndefault state is 3\\n\\nUser input follows this Prompt\\n\\n\\n'}, {'role': 'user', 'content': 'red ferrari'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"2\",\\n  \"prompt\": \"A highly detailed, photorealistic image of a sleek, vibrant red Ferrari, specifically a modern 296 GTB, parked in a futuristic, minimalist garage with soft, ambient lighting reflecting off its polished surface. The background features a large panoramic window revealing a stunning twilight cityscape. High resolution, dramatic lighting, luxury car photography style.\"\\n}\\n```'}, {'role': 'user', 'content': 'IMAGE GENERATED'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"0\",\\n  \"description\": \"exit\"\\n}\\n```'}, {'role': 'user', 'content': 'make it green'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"2\",\\n  \"prompt\": \"A highly detailed, photorealistic image of a sleek, vibrant green Ferrari, specifically a modern 296 GTB, parked in a futuristic, minimalist garage with soft, ambient lighting reflecting off its polished surface. The background features a large panoramic window revealing a stunning twilight cityscape. High resolution, dramatic lighting, luxury car photography style.\"\\n}\\n```'}, {'role': 'user', 'content': 'IMAGE GENERATED'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"0\",\\n  \"description\": \"exit\"\\n}\\n```'}, {'role': 'user', 'content': 'add a blue one also'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"2\",\\n  \"prompt\": \"A highly detailed, photorealistic image featuring two sleek, vibrant Ferraris. One is a modern 296 GTB in a striking vibrant green, and the other is an identical model in a deep, glossy blue. Both cars are parked side-by-side in a futuristic, minimalist garage with soft, ambient lighting reflecting off their polished surfaces. The background features a large panoramic window revealing a stunning twilight cityscape. High resolution, dramatic lighting, luxury car photography style.\"\\n}\\n```'}, {'role': 'user', 'content': 'IMAGE GENERATED'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"0\",\\n  \"description\": \"exit\"\\n}\\n```'}, {'role': 'user', 'content': 'show history'}, {'role': 'model', 'content': '```json\\n{\\n  \"state\": \"5\",\\n  \"description\": \"history\"\\n}\\n```'}]", "image": "", "object": "", "session_id": "ec57e2fa-b86c-4bcd-bbe4-92b442db1c1b"}